var $ = require('jquery');
$(function(){
  var cur=1;
  var bookList=[{img:"http://127.0.0.1:8080/img/生活好习惯.png",title:"《培养生活好习惯》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生独立自强的能力，养成生活好习惯。"},
    {img:"http://127.0.0.1:8080/img/塑造做人好心态1彩x4.png",title:"《塑造做人好心态》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的心态，让其达到遇事不怕、不乱，保持良好心态的效果。"},
    {img:"http://127.0.0.1:8080/img/学习好方法.png",title:"《掌握学习好方法》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的学习能力，实现爱学习、会学习的状态，掌握正确的学习方法。"},
    {img:"http://127.0.0.1:8080/img/提升国学好素养.png",title:"《提升国学好素养》",content:"晋级非智力开发课程之一，旨在通过学习国学思想，培养学生传统文化意识，成为一名优秀的传统文化继承人。"},
    {img:"http://127.0.0.1:8080/img/锻炼健壮好身体.png",title:"《锻炼健壮好身体》",content:"晋级非智力开发教程之一，旨在通过学习，让学生了解锻炼对身体的好处，养成爱运动的好习惯。"},
    {img:"http://127.0.0.1:8080/img/晋级教育形象手册.png",title:"《晋级教育形象手册》",content:"本画册用了晋级多年创业发展中的大量实景图片加文字，对与之相配套的所有理论、所有实践，进行了全景观的介绍。"},
    {img:"http://127.0.0.1:8080/img/晋级教育形象手册.png",title:"《晋级教育形象手册》",content:"本画册用了晋级多年创业发展中的大量实景图片加文字，对与之相配套的所有理论、所有实践，进行了全景观的介绍。"},
    {img:"http://127.0.0.1:8080/img/晋级教育合作手册.png",title:"《晋级教育合作手册》",content:"为您呈上一份五大课题论证报告，为您提供一个壮大自我发展平台。"},
    {img:"http://127.0.0.1:8080/img/日常管理180条（封面）.png",title:"《日常管理180条》",content:"行政管理类、安全管理类、物品管理类等，共计180条。"},
    {img:"http://127.0.0.1:8080/img/带好托管50法（封面）.png",title:"《带好托管50法》",content:"晋级教师通过多年的带班经验总结出了50种不同的带好托管的方法，如：摸底建档法、影像纠正法、临别德育法等。"},
    {img:"http://127.0.0.1:8080/img/我爱托管18感（封面）.png",title:"《我爱托管18感》",content:"托管机构的校长用什么给需要带托管的老师成功洗脑？这套可以复制的“晋级洗脑模式”，18种理由任你选。"},
    {img:"http://127.0.0.1:8080/img/托管流程全解密（封面）.png",title:"《托管流程全解密》",content:"内容包含午托、晚托、日托、全托、精品托、双休托的托管流程和注意事项，解决托管老师带班纪律差，老师累等问题"},
    {img:"http://127.0.0.1:8080/img/生活好习惯.png",title:"《培养生活好习惯》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生独立自强的能力，养成生活好习惯。"},
    {img:"http://127.0.0.1:8080/img/塑造做人好心态1彩x4.png",title:"《塑造做人好心态》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的心态，让其达到遇事不怕、不乱，保持良好心态的效果。"},
    {img:"http://127.0.0.1:8080/img/学习好方法.png",title:"《掌握学习好方法》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的学习能力，实现爱学习、会学习的状态，掌握正确的学习方法。"},
    {img:"http://127.0.0.1:8080/img/提升国学好素养.png",title:"《提升国学好素养》",content:"晋级非智力开发课程之一，旨在通过学习国学思想，培养学生传统文化意识，成为一名优秀的传统文化继承人。"},
    {img:"http://127.0.0.1:8080/img/锻炼健壮好身体.png",title:"《锻炼健壮好身体》",content:"晋级非智力开发教程之一，旨在通过学习，让学生了解锻炼对身体的好处，养成爱运动的好习惯。"},
    {img:"http://127.0.0.1:8080/img/生活好习惯.png",title:"《培养生活好习惯》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生独立自强的能力，养成生活好习惯。"},
    {img:"http://127.0.0.1:8080/img/塑造做人好心态1彩x4.png",title:"《塑造做人好心态》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的心态，让其达到遇事不怕、不乱，保持良好心态的效果。"},
    {img:"http://127.0.0.1:8080/img/学习好方法.png",title:"《掌握学习好方法》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的学习能力，实现爱学习、会学习的状态，掌握正确的学习方法。"},
    {img:"http://127.0.0.1:8080/img/提升国学好素养.png",title:"《提升国学好素养》",content:"晋级非智力开发课程之一，旨在通过学习国学思想，培养学生传统文化意识，成为一名优秀的传统文化继承人。"},
    {img:"http://127.0.0.1:8080/img/锻炼健壮好身体.png",title:"《锻炼健壮好身体》",content:"晋级非智力开发教程之一，旨在通过学习，让学生了解锻炼对身体的好处，养成爱运动的好习惯。"},
    {img:"http://127.0.0.1:8080/img/生活好习惯.png",title:"《培养生活好习惯》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生独立自强的能力，养成生活好习惯。"},
    {img:"http://127.0.0.1:8080/img/塑造做人好心态1彩x4.png",title:"《塑造做人好心态》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的心态，让其达到遇事不怕、不乱，保持良好心态的效果。"},
    {img:"http://127.0.0.1:8080/img/学习好方法.png",title:"《掌握学习好方法》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的学习能力，实现爱学习、会学习的状态，掌握正确的学习方法。"},
    {img:"http://127.0.0.1:8080/img/提升国学好素养.png",title:"《提升国学好素养》",content:"晋级非智力开发课程之一，旨在通过学习国学思想，培养学生传统文化意识，成为一名优秀的传统文化继承人。"},
    {img:"http://127.0.0.1:8080/img/锻炼健壮好身体.png",title:"《锻炼健壮好身体》",content:"晋级非智力开发教程之一，旨在通过学习，让学生了解锻炼对身体的好处，养成爱运动的好习惯。"},
    {img:"http://127.0.0.1:8080/img/生活好习惯.png",title:"《培养生活好习惯》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生独立自强的能力，养成生活好习惯。"},
    {img:"http://127.0.0.1:8080/img/塑造做人好心态1彩x4.png",title:"《塑造做人好心态》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的心态，让其达到遇事不怕、不乱，保持良好心态的效果。"},
    {img:"http://127.0.0.1:8080/img/学习好方法.png",title:"《掌握学习好方法》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的学习能力，实现爱学习、会学习的状态，掌握正确的学习方法。"},
    {img:"http://127.0.0.1:8080/img/提升国学好素养.png",title:"《提升国学好素养》",content:"晋级非智力开发课程之一，旨在通过学习国学思想，培养学生传统文化意识，成为一名优秀的传统文化继承人。"},
    {img:"http://127.0.0.1:8080/img/锻炼健壮好身体.png",title:"《锻炼健壮好身体》",content:"晋级非智力开发教程之一，旨在通过学习，让学生了解锻炼对身体的好处，养成爱运动的好习惯。"},
    {img:"http://127.0.0.1:8080/img/生活好习惯.png",title:"《培养生活好习惯》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生独立自强的能力，养成生活好习惯。"},
    {img:"http://127.0.0.1:8080/img/塑造做人好心态1彩x4.png",title:"《塑造做人好心态》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的心态，让其达到遇事不怕、不乱，保持良好心态的效果。"},
    {img:"http://127.0.0.1:8080/img/学习好方法.png",title:"《掌握学习好方法》",content:"晋级非智力开发教程之一，旨在通过学习，提升学生的学习能力，实现爱学习、会学习的状态，掌握正确的学习方法。"},
    {img:"http://127.0.0.1:8080/img/提升国学好素养.png",title:"《提升国学好素养》",content:"晋级非智力开发课程之一，旨在通过学习国学思想，培养学生传统文化意识，成为一名优秀的传统文化继承人。"},
    {img:"http://127.0.0.1:8080/img/锻炼健壮好身体.png",title:"《锻炼健壮好身体》",content:"晋级非智力开发教程之一，旨在通过学习，让学生了解锻炼对身体的好处，养成爱运动的好习惯。"},
  ];
  $(".g-group__pager li").not(".prev,.next").click(function(){
      var page=parseInt($(this).text());
      var pageSize=6;
      var str='';
      for(var i=(page-1)*pageSize;i<page*pageSize;i++){
        var obj=bookList[i];
        str+='<li>' +
          '              <div class="g-group__pic">' +
          '                <img src="'+obj.img+'?t='+Math.random()+'" alt="'+obj.title+'"/>' +
          '              </div>' +
          '              <div class="g-group__explain">' +
          '                <section>' +
          '                  <h3>'+obj.title+'</h3>' +
          '                  <p>'+obj.content+'</p>' +
          '                </section>' +
          '              </div>' +
          '            </li>';
      }
    $(".g-group__list").append(str);
    $(this).addClass("current").siblings().removeClass("current");
  });
});
